getCustomer/src/main/resources/examples/customerservice.response.example.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tar="http://backendSystem/target/">
   <soapenv:Header/>
   <soapenv:Body>
      <tar:getCustomerInfoRequest>
         <externalClientNo>?</externalClientNo>
      </tar:getCustomerInfoRequest>
   </soapenv:Body>
</soapenv:Envelope>